{"_path":"/articles/openmusic","_dir":"articles","_draft":false,"_partial":false,"_locale":"","title":"OpenMusic - My first Open source project","description":"The rise and downfall of the OpenMusic project. Why it is important to not overestimate your workload","date":"2023-09-23T19:45:07.862Z","tags":["projects"],"draft":false,"cover":"/articles/openmusic.webp","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"openmusic-formerly-socymusic"},"children":[{"type":"text","value":"OpenMusic (formerly SocyMusic)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"OpenMusic began as my venture into creating the ultimate free open-source music player for Android devices. My aim was simple: a clean, minimalist design packed with features catering to music enthusiasts of all kinds."}]},{"type":"element","tag":"h2","props":{"id":"the-spark-of-inspiration"},"children":[{"type":"text","value":"The Spark of Inspiration"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This project sparked to life during one summer break when I found myself with ample free time and a desire to delve into Java programming for Android. While I had prior experience with Java, crafting an Android app was an uncharted territory for me. I figured that designing a music player would be a straightforward task, and so, I embarked on this exciting journey."}]},{"type":"element","tag":"h2","props":{"id":"the-learning-curve"},"children":[{"type":"text","value":"The Learning Curve"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With little guidance on what my music player should offer, I turned to Reddit for suggestions. What I didn't anticipate was the flood of responses that poured in. My humble music player project on GitHub garnered unexpected attention, attracting a diverse community eager to collaborate and assist."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My misstep here was relying too heavily on these contributors. As they poured in code, the project's scope spiraled out of control, and I soon lost sight of its direction. Additionally, I made the mistake of attempting to meet every demand, which eventually overwhelmed me."}]},{"type":"element","tag":"h2","props":{"id":"the-setback"},"children":[{"type":"text","value":"The Setback"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As my project spiraled out of control, real life beckoned with the return of school. This significantly reduced my free time, leading to the inevitable downfall of OpenMusic. I had no choice but to shelve it, albeit not permanently. I opted to archive the project, ensuring that others could still benefit from it if the need arose."}]},{"type":"element","tag":"h2","props":{"id":"the-lessons-learned"},"children":[{"type":"text","value":"The Lessons Learned"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"OpenMusic taught me invaluable lessons in managing open-source projects. Structuring projects methodically, maintaining order, and documenting every step and feature are crucial to avoid chaos. Effective communication is equally vital. Without a means to interact with fellow developers, seeking specific features, conducting tests, and documenting code contributions become nearly impossible."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even long after I archived the project, I stumbled upon Reddit posts expressing disappointment about the unfinished app. This tugged at my heartstrings, but by then, the post was old, and I had moved on to other projects. I made the difficult choice to let OpenMusic remain in the past."}]},{"type":"element","tag":"h2","props":{"id":"in-retrospect"},"children":[{"type":"text","value":"In Retrospect"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The key takeaway from this experience is not to push oneself beyond limits. Setting priorities in life is crucial to prevent unnecessary stress. Careful planning, constant communication with contributors, and publishing projects when you're genuinely ready for feedback are all essential. It's important to recognize that it's impossible for a single person to appease everyone's desires in a project."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ultimately, OpenMusic served as a valuable teacher. I made mistakes along the way, but I wouldn't change a thing. I'm proud of what I accomplished, and it was a significant learning opportunity."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can find the archived OpenMusic project "},{"type":"element","tag":"a","props":{"href":"https://github.com/Benji377/OpenMusic","rel":["nofollow"]},"children":[{"type":"text","value":"here"}]},{"type":"text","value":"."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-spark-of-inspiration","depth":2,"text":"The Spark of Inspiration"},{"id":"the-learning-curve","depth":2,"text":"The Learning Curve"},{"id":"the-setback","depth":2,"text":"The Setback"},{"id":"the-lessons-learned","depth":2,"text":"The Lessons Learned"},{"id":"in-retrospect","depth":2,"text":"In Retrospect"}]}},"_type":"markdown","_id":"content:articles:openmusic.md","_source":"content","_file":"articles/openmusic.md","_extension":"md"}